/*
Made by Aine
*/

let handler = async (m, { conn }) => {
	let img = 'https://i.ibb.co/HtyFcs1/Tlok-L0r0-Ptqst5v35-O9p-GAHa-E6.jpg'
	let dares = [
		"هل حدث غدر في حياتك قبل ذلك ؟",
		"هل تتميز بكونك شخص متسامح أم لا؟",
		"ما هي عيوبك؟",
		"هل حدث في يوم أنك تعرضت للخيانة ؟",
		"ما هي القرارات في حياتك التي لم تندم عليها ؟",
		"هل تمتلك شخصية متميزة في حياتك ؟",
		"من هو الشخص الذي يلزم تفكيرك ؟",
		"من الشخص المفضل لديك الذي ترغب اصطحابه في نزهة ؟",
		  "هل لديك الشجاعة أن تتدخل عندما ترى حادثًا أمامك ؟",
		"من هو الشخص الذي لا تتمكن من رفض طلبه ؟",
		"كيف يمكنك أن تظهر إعجابك بشخص ما ؟",
		"هل تمتلك شخصية متناقضة ؟",
		"في أي موقف تعرضت للإحراج الشديد ؟",
		"هل تعمل بإتقان أو لا تحب العمل ؟    ",
		"هل تتذكر موقف أبكاك أمام الناس دون أن تشعر ؟",
		"هل لديك تجربة سابقة تتمنى تكرارها ؟",
		"لو أحضرت لك ورقة بيضاء ماذا سترسم لتعبر عن حالتك الآن ؟",
		"هل أنت من الشخصيات العدوانية ؟",
		"هل سبق لك وخططت لحرب من أجل شخص ؟",
		"ما هي الكلمات التي تشعرك بالارتباك",
		"من هو مثلك الأعلى ؟",
		"من هو الشخص الذي تظهر أمامه نقطة ضعفك ؟",
		"منشن الشخص الذي تحبه",
		"منشن الشخص الذي تكرهه",
		"هل تحب المطور جيرايا؟",
		"هل تحب السيسي 🤣؟",
		"كم مرة ضحكت اليوم؟",
		"هل قرأت القرآن اليوم؟ اذا كان جواب لا، انصحك تروح تقرأه فهو مريح",
		"هل صليت؟ اذا كان لا قم صلي الان والله يتقبل",
		"هل تحب خامس منشن؟",
		"هل تحب اول منشن؟",
		"اذا كنت قائد المجموعه ماذا ستقدم كقائد؟",
		"اوصف قائد المجموعه بالنسبة لك؟",
		"هل مشرفين المجموعه مقصرين؟",
		"هل أنت من الأشخاص الاجتماعيين أو الانطوائيين ؟",
		"ماذا يكون رد فعلك عندما يطلب منك شريك حياتك الإنفصال ؟",
		"هل من الممكن أن تعبر عن حياتك بكلمة واحدة ؟",
		"ما هو الخبر السيئ لك ؟",
		"هل قمت قبل ذلك بالكذب على شخص من خلال الاحتيال عليه ؟",
		"مالذي يشعرك بالخوف ؟    ",
		"ما هي مقدار ثقتك في نفسك ؟",
		"هل أنت فخوراً بوالديك ؟",
		"هل يمكن أن تستعر من والدك بسبب عمله ؟",
		"هل لديك شخص إذا خرج من حياتك لا تشعر بالندم ؟",
		"هل سبق لك أن تحدثت بكلام تندم عليه الآن ؟",
		"ما هي الشخصية التي أثرت في شخصيتك ؟",
		"هل لديك رغبة تملك كل شيء ؟",
		"هل أنت راضٍ عن نفسك ؟",
		"ما هو الشيء الذي يغضبك بشدة ؟",
		"هل تمتلك نفسه الحب لكل إخوتك ؟",
		"هل سبق لك ودمرت حياة أحد أقاربك ؟",
		"من هو الشخص الذي تأتمنه على كل أسرارك ؟",
		"هل تحكم على الأشخاص بسبب ملابسهم ؟",
		"ماذا يلفت إنتباهك ؟",
		"هل تمتلك شخصية صادقة أم منافقة ؟",
		"هل يوجد شخص متعلق به بشكل لا يمكن وصفه ؟",
		"هل وجهت تحديد لأي شخص من قبل بسبب تصرفاته ؟",
		"هل يتملكك شعور بالسعادة ؟",
		"من الشخص الذي رحيله عن الحياة يشعرك بالألم ؟",
		"هل خذلك أحدًا من قبل ؟",
		"هل أنت إنسان سلبي أم إيجابي .",
		"هل استخدمت كلمة أحبك من قبل ؟",
		"ما هو مستوى تعليمك ؟",
		"ما هو الإقرار الذي يمكن أن تتخذه على نفسك ؟",
		"هل من الممكن أن يتحول صديقك إلى حبيب ؟",
		"هل سبق وتعرضت للظلم من قبل ؟",
		"هل سبق وكذبت من قبل ؟",
		"من الشخص الأغلى في حياتك ؟",
		"هل سبق لك وقمت بتناول المخدر والحشيش ؟",
		"هل ندمتي على حب شخص من قبل ؟",
		"ما الموقف الصعب الذي تعرضتي له ولن تنسيه أبدًا ؟",
		"هل هناك شخص يطاردك .",
		 "هل راودك بالرغبة في الموت ؟",
		 "هل سبق لك و قمت بتوبيخ نفسك ؟",
		 "هل تفضل الزوجة العاملة أو الزوجة التي تجلس في المنزل ؟",
		 "وجه كلمة للمرأة التي ترتدي ملابس خادشة للحياء ؟",
		 "هل تصدر أحكامًا على المرأة بسبب ملابسها ؟",
		 "كم مرة تنازلت عن مبادئك بسبب شخص ؟",
		 "هل تؤمن بالحب من النظرة الأولى ؟     "
] // tambahin kata kata sendiri 
	conn.sendFile(m.chat, img, 'maker.jpeg', `*حقيقة*\n\n“${pickRandom(dares)}”`, m, false, { thumbnail: Buffer.alloc(0) })
}
handler.help = ['حقيقة']
handler.tags = ['الاوامر']
handler.command = /^(حقيقة|berani|tantangan)$/i
handler.limit = false

module.exports = handler

function pickRandom(list) {
  return list[Math.floor(list.length * Math.random())]
}
